### Задача 1

Загрузите содержимое файла `Homework1.csv` в DataFrame и выведите первые пять строк на экран. В следующей ячейке посчитайте среднее значение температуры (столбец `Temperature`) и выведите её на экран.

In [1]:
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
### YOUR CODE HERE ###
df = pd.read_csv("Homework1.csv")
df.head()

      id        Date           City  Temperature
0  32208  01.01.2012  New York City         47.4
1  32209  02.01.2012  New York City         42.9
2  32210  03.01.2012  New York City         29.8
3  32211  04.01.2012  New York City         19.1
4  32212  05.01.2012  New York City         31.7

In [3]:
### YOUR CODE HERE ###
df["Temperature"].mean()

58.06857923497273

### Задача 2

Сохраните DataFrame из предыдущей задачи в файл `result1.csv`, в качестве разделителя используйте запятую `,`, а в качестве названия столбца-индекса — `index`.

In [5]:
### YOUR CODE HERE ###
df.to_csv("result1.csv", sep=',', index_label="index")

### Задача 3

Загрузите содержимое файла `Homework1.csv` в DataFrame, при этом отформатируйте столбец с датой (`Date`) и приведите его к стандартизированному виду. Выведите первые пять строк DataFrame на экран.

In [13]:
### YOUR CODE HERE ###
df = pd.read_csv("Homework1.csv", parse_dates=["Date"])
df.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-02-01  New York City         42.9
2  32210 2012-03-01  New York City         29.8
3  32211 2012-04-01  New York City         19.1
4  32212 2012-05-01  New York City         31.7

# Чтение и запись данных, часть 1

## Домашнее задание 

### Описание домашнего задания и формат сдачи

Выполните предложенные задачи — впишите свой код в ячейки после комментария `### YOUR CODE HERE ###` и сохраните изменения, используя опцию *Save and Checkpoint* из вкладки меню *File* или кнопку *Save and Checkpoint* на панели инструментов. Итоговый файл в формате `.ipynb` (файл Jupyter Notebook) загрузите в личный кабинет и отправьте на проверку.

### Задача 4

Сохраните DataFrame из предыдущей задачи в файл `result2.xlsx`.

In [8]:
### YOUR CODE HERE ###
df.to_excel("result2.xlsx")

### Задача 5

Загрузите содержимое файла `Homework2.csv` в DataFrame, укажите правильный разделитель столбцов, отформатируйте столбец с датой (`Date`) и приведите его к стандартизированному виду. Выведите первые пять строк DataFrame на экран.

In [14]:
### YOUR CODE HERE ###
df2 = pd.read_csv("Homework2.csv", sep=';', parse_dates=["Date"])
df2.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-02-01  New York City         42.9
2  32210 2012-03-01  New York City         29.8
3  32211 2012-04-01  New York City         19.1
4  32212 2012-05-01  New York City         31.7

### Задача 6

Сохраните DataFrame из предыдущей задачи в файл `result3.xlsx`, при сохранении задайте листу имя `MySheet`.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр `sheet_name`.)

In [10]:
### YOUR CODE HERE ###
df2.to_excel("result3.xlsx", sheet_name="MySheet")

### Задача 7

Загрузите содержимое файла `Homework3.xlsx` в DataFrame, отформатируйте столбец с датой (`Date`) и приведите его к стандартизированному виду. Выведите первые пять строк DataFrame на экран.

После этого в следующей ячейке сохраните полученный DataFrame в этот же файл, в лист с названием `MySheet`. При сохранении передайте в функцию сохранения параметр `index` c булевым значением `False`, чтобы не сохранять столбец-индекс.

Затем откройте файл `Homework3.xlsx` с помощью Excel или аналога и посмотрите, сколько листов сейчас содержит этот файл. Ответ запишите в секции `### YOUR COMMENTS HERE ###` под блоками для кода.

In [17]:
### YOUR CODE HERE ###
df3 = pd.read_excel("Homework3.xlsx", parse_dates=["Date"])
df3.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-01-02  New York City         42.9
2  32210 2012-01-03  New York City         29.8
3  32211 2012-01-04  New York City         19.1
4  32212 2012-01-05  New York City         31.7

In [18]:
### YOUR CODE HERE ###
df3.to_excel("Homework3.xlsx", sheet_name="MySheet", index=False)

\### YOUR COMMENTS HERE ###
Один лист содержит, т.к. файл перезаписывается.

### Задача 8

Загрузите содержимое файлов `Homework1.csv` и `Homework4.csv` в разные датафреймы (DataFrame), выведите первые пять строк каждого датафрейма на экран. После этого объедините датафреймы по столбцу `id` с использованием метода `merge`, выведите первые пять строк объединённого датафрейма на экран и запишите объединённый датафрейм в файл `result4.csv`, указав в качестве разделителя точку с запятой `;`.

In [20]:
### YOUR CODE HERE ###
df1 = pd.read_csv("Homework1.csv", parse_dates=["Date"])
df4 = pd.read_csv("Homework4.csv")

print(df1[:5])
print(df4[:5])

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-02-01  New York City         42.9
2  32210 2012-03-01  New York City         29.8
3  32211 2012-04-01  New York City         19.1
4  32212 2012-05-01  New York City         31.7
      id  Sales
0  32208     36
1  32209     34
2  32210     40
3  32211     35
4  32212     48

In [21]:
### YOUR CODE HERE ###
df_u = df1.merge(df4, how='outer', on="id")
df_u.head()

      id       Date           City  Temperature  Sales
0  32208 2012-01-01  New York City         47.4     36
1  32209 2012-02-01  New York City         42.9     34
2  32210 2012-03-01  New York City         29.8     40
3  32211 2012-04-01  New York City         19.1     35
4  32212 2012-05-01  New York City         31.7     48

In [22]:
### YOUR CODE HERE ###
df_u.to_csv("result4.csv", sep=';')

In [ ]:
### YOUR CODE HERE ###

## Дополнительные (необязательные) задачи

### Задача 9

Загрузите содержимое файлов `Homework2.csv` и `Homework5.xlsx` в разные датафреймы (DataFrame), при этом в каждом датафрейме отформатируйте столбец с датой (`Date`) и приведите его к стандартизированному виду. После этого выведите первые пять строк каждого датафрейма на экран. Затем объедините датафреймы по столбцу `Date` с использованием метода `merge`, выведите первые пять строк объединённого датафрейма на экран и запишите объединённый датафрейм в файл `result5.csv`, указав в качестве разделителя символ табуляции `\t`.

In [ ]:
### YOUR CODE HERE ###

In [ ]:
### YOUR CODE HERE ###

In [ ]:
### YOUR CODE HERE ###

In [ ]:
### YOUR CODE HERE ###

### Задача 10

Вы могли заметить, что столбец `Temperature` всех предыдущих датафреймов содержит достаточно высокое значение. Это потому, что данные по температуре приведены для города Нью-Йорк, а в США принято измерять температуру в градусах Фаренгейта, а не Цельсия. Для перевода температуры из градусов Фаренгейта в градусы Цельсия используется следующая формула:

$$
T_C = (T_F-32)\times5/9,
$$

где $T_F$ — температура в градусах Фаренгейта, а $T_C$ — температура в градусах Цельсия. 

Используя приведённую формулу, добавьте в объединённый датафрейм из предыдущей задачи новый столбец `Temperature_C`, содержащий температуру в градусах Цельсия. Данные по температуре в градусах Фаренгейта приведены в столбце `Temperature`. Полученный датафрейм сохраните в файл `result6.csv`.

In [ ]:
### YOUR CODE HERE ###

### Задача 11

Используя объединённый датафрейм из предыдущей задачи, постройте график Scatter зависимости продаж (столбец `Sales`) от температуры (столбец `Temperature_C`) с помощью библиотеки Matplotlib. Попробуйте сделать предположение о зависимости продаж от температуры. Как вы думаете, продажи какого товара приведены в датафрейме? Почему? (Ответ запишите в блоке ### YOUR COMMENTS HERE ###.)

In [ ]:
### YOUR CODE HERE ###

\### YOUR COMMENTS HERE ###